gzehentner/ESP32_Projects/Wasserstand_ESP_V07/src/Wasserstand_V7.cpp
  while (file.available())
  {

    c = file.read();

    if (c == '\n')
    {
      // with every new line decode setting
      if (tokenName == "pump1_operationTime")
      {
        pumpStatus.pump1_operationTime = tokenValue.toInt();
      }
      if (tokenName == "pump2_operationTime")
      {
        pumpStatus.pump2_operationTime = tokenValue.toInt();
      }
      if (tokenName == "linkPump")
      {
        pumpStatus.linkPump = tokenValue.toInt();
      }

      // and prepare for next line
      isToken = 1;
      tokenName = "";
      tokenValue = "";
    }
    else if (c == '=')
    {
      // with every equ switch to value
      isToken = 0;
    }
    else if (c == ' ')
    {
      // space: do nothing
    }
    else
    {

      // get char and add to appropriate string
      if (isToken == 1)
      {
        tokenName += c;
      }
      else
      {
        tokenValue += c;
      }
    }
    // noValues ++;
  }
  file.close();
}
//*******************************************************************************
// write values to setup.ini
void putSetupIni(PumpStatus &pumpStatus)
//*******************************************************************************
{
  Serial.println("putSetupIni entered");
  String tempString = "";

  tempString += String("pump1_operationTime=");
  tempString += String(pumpStatus.pump1_operationTime);
  tempString += String(";\npump2_operationTime=");
  tempString += String(pumpStatus.pump2_operationTime);
  tempString += String(";\nlinkPump=");
  tempString += String(pumpStatus.linkPump);
  tempString += String(";\n");

  writeFile("/setup.ini", (tempString).c_str()); // Append data to the file
  Serial.println("data appended");
}